particle-iot/device-os/hal/src/nRF52840/spi_hal.cpp
    if (spi == HAL_SPI_INTERFACE1 && mode == SPI_MODE_SLAVE) {
        // HAL_SPI_INTERFACE1 does not support slave mode
        return;
    }

    if (spiMap[spi].state == HAL_SPI_STATE_ENABLED) {
        // Make sure we reset the enabled state
        spiUninit(spi);
        spiMap[spi].state = HAL_SPI_STATE_DISABLED;
    }

    if (pin == SPI_DEFAULT_SS) {
        if (spi == HAL_SPI_INTERFACE1) {
            spiMap[spi].ss_pin = SS;
        } else if (spi == HAL_SPI_INTERFACE2) {
            spiMap[spi].ss_pin = D5;
        } else {
            spiMap[spi].ss_pin = PIN_INVALID;
        }
    } else {
        spiMap[spi].ss_pin = pin;
    }

    if (mode == SPI_MODE_SLAVE && !HAL_Pin_Is_Valid(spiMap[spi].ss_pin)) {
        // Slave mode requires a valid pin
        return;
    }

    freeMemoryIfNecessary(spi);

    spiMap[spi].spi_mode = mode;
    spiInit(spi, mode);
    spiMap[spi].state = HAL_SPI_STATE_ENABLED;
}

void hal_spi_end(hal_spi_interface_t spi) {
    if (spiMap[spi].state != HAL_SPI_STATE_DISABLED) {
        freeMemoryIfNecessary(spi);
        spiUninit(spi);
        spiMap[spi].state = HAL_SPI_STATE_DISABLED;
    }
}

void hal_spi_set_bit_order(hal_spi_interface_t spi, uint8_t order) {
    spiMap[spi].bit_order = order;
    if (spiMap[spi].state == HAL_SPI_STATE_ENABLED) {
        spiUninit(spi);
        spiInit(spi, spiMap[spi].spi_mode);
    }
}

void hal_spi_set_data_mode(hal_spi_interface_t spi, uint8_t mode) {
    spiMap[spi].data_mode = mode;
    if (spiMap[spi].state == HAL_SPI_STATE_ENABLED) {
        spiUninit(spi);
        spiInit(spi, spiMap[spi].spi_mode);
    }
}

void hal_spi_set_clock_divider(hal_spi_interface_t spi, uint8_t rate) {
    // actual speed is the system clock divided by some scalar
    spiMap[spi].clock = rate;
    if (spiMap[spi].state == HAL_SPI_STATE_ENABLED) {
        spiUninit(spi);
        spiInit(spi, spiMap[spi].spi_mode);
    }
}

uint16_t hal_spi_transfer(hal_spi_interface_t spi, uint16_t data) {
    if (spiMap[spi].spi_mode == SPI_MODE_SLAVE) {
        return 0;
    }
    if (spiMap[spi].state != HAL_SPI_STATE_ENABLED) {
        return 0;
    }

    uint8_t tx_buffer __attribute__((__aligned__(4)));
    uint8_t rx_buffer __attribute__((__aligned__(4)));

    // Wait for SPI transfer finished
    while(spiMap[spi].transmitting) {
        ;
    }

    freeMemoryIfNecessary(spi);

    tx_buffer = data;

    spiMap[spi].dma_user_callback = nullptr;
    spiMap[spi].transfer_length = spiTransfer(spi, &tx_buffer, &rx_buffer, 1);

    // Wait for SPI transfer finished
    while(spiMap[spi].transmitting) {
        ;
    }

    return rx_buffer;
}

bool hal_spi_is_enabled(hal_spi_interface_t spi) {
    return spiMap[spi].state == HAL_SPI_STATE_ENABLED;
}

bool hal_spi_is_enabled_deprecated(void) {
    return false;
}

void hal_spi_info(hal_spi_interface_t spi, hal_spi_info_t* info, void* reserved) {
    info->system_clock = SPI_SYSTEM_CLOCK;
    if (info->version >= HAL_SPI_INFO_VERSION_1) {
        int32_t state = HAL_disable_irq();
        if (spiMap[spi].state == HAL_SPI_STATE_ENABLED) {
            switch (spiMap[spi].clock) {
                case SPI_CLOCK_DIV2:   info->clock = info->system_clock / 2;   break;
                case SPI_CLOCK_DIV4:   info->clock = info->system_clock / 4;   break;
                case SPI_CLOCK_DIV8:   info->clock = info->system_clock / 8;   break;
                case SPI_CLOCK_DIV16:  info->clock = info->system_clock / 16;  break;
                case SPI_CLOCK_DIV32:  info->clock = info->system_clock / 32;  break;
                case SPI_CLOCK_DIV64:  info->clock = info->system_clock / 64;  break;
                case SPI_CLOCK_DIV128: info->clock = info->system_clock / 128; break;
                case SPI_CLOCK_DIV256: info->clock = info->system_clock / 256; break;
                default: info->clock = 0;
            }
        } else {
            info->clock = 0;
        }
        info->default_settings = ((spiMap[spi].spi_mode  == DEFAULT_SPI_MODE) &&
                                  (spiMap[spi].bit_order == DEFAULT_BIT_ORDER) &&
                                  (spiMap[spi].data_mode == DEFAULT_DATA_MODE) &&
                                  (spiMap[spi].clock     == DEFAULT_SPI_CLOCK));
        info->enabled = (spiMap[spi].state == HAL_SPI_STATE_ENABLED);
        info->mode = spiMap[spi].spi_mode;
        info->bit_order = spiMap[spi].bit_order;
        info->data_mode = spiMap[spi].data_mode;
        if (info->version >= HAL_SPI_INFO_VERSION_2) {
            info->ss_pin = spiMap[spi].ss_pin;
        }
        HAL_enable_irq(state);
    }
}

void hal_spi_set_callback_on_selected(hal_spi_interface_t spi, hal_spi_select_user_callback cb, void* reserved) {
    spiMap[spi].select_user_callback = cb;
}

void hal_spi_transfer_dma(hal_spi_interface_t spi, const void* tx_buffer, void* rx_buffer, uint32_t length, hal_spi_dma_user_callback userCallback) {
    if (length == 0) {
        return;
    }
    if (spiMap[spi].state != HAL_SPI_STATE_ENABLED) {
        return;
    }

    while(spiMap[spi].transmitting) {
        ;
    }

    freeMemoryIfNecessary(spi);

    spiMap[spi].dma_user_callback = userCallback;
    if (spiMap[spi].spi_mode == SPI_MODE_MASTER) {
        if (tx_buffer && !nrfx_is_in_ram(tx_buffer)) {
            // Truncate the data to reuse an allocated pool.
            spiMap[spi].master_tx_buf = (uint8_t*)malloc(SPI_BUFFER_LENGTH);
            if (spiMap[spi].master_tx_buf == nullptr) {
                return;
            }
            spiMap[spi].master_tx_data = (const uint8_t *)tx_buffer;
            spiMap[spi].master_tx_data_length = length;
            spiMap[spi].master_tx_data_index = 0;
            spiMap[spi].master_rx_buf = (uint8_t *)rx_buffer;
            spiMap[spi].transfer_length = 0;
            spiMasterTransferChunk(spi);
        } else {
            // tx_buffer is nullptr, or tx_buffer is pointing to RAM.
            SPARK_ASSERT(spiTransfer(spi, (uint8_t*)tx_buffer, (uint8_t *)rx_buffer, length) == length);
            spiMap[spi].transfer_length = length;
        }
    } else {
        if (tx_buffer && !nrfx_is_in_ram(tx_buffer)) {
            // The allocated memory will be freed on hal_spi_end() or hal_spi_transfer_dma() is called
            spiMap[spi].slave_tx_buf = (uint8_t*)malloc(length);
            if (spiMap[spi].slave_tx_buf == nullptr) {
                return;
            }
            memcpy(spiMap[spi].slave_tx_buf, tx_buffer, length);
            spiMap[spi].slave_tx_buf_heap = true;
        } else {
            spiMap[spi].slave_tx_buf = (uint8_t*)tx_buffer;
            spiMap[spi].slave_tx_buf_heap = false;
        }
        spiMap[spi].slave_buf_length = length;
        spiMap[spi].slave_rx_buf = (uint8_t *)rx_buffer;

        // The nrfx driver will panic if the pointers are nullptr and length is not 0.
        uint32_t txLen = spiMap[spi].slave_tx_buf ? length : 0;
        uint32_t rxLen = spiMap[spi].slave_rx_buf ? length : 0;

        // Use for synchronization
        spiMap[spi].transmitting = true;
        // reset transfer length
        spiMap[spi].transfer_length = 0;

        uint32_t err_code = nrfx_spis_buffers_set(spiMap[spi].slave, spiMap[spi].slave_tx_buf, txLen, spiMap[spi].slave_rx_buf, rxLen);
        if (err_code == NRF_ERROR_INVALID_STATE) {
            // LOG_DEBUG(WARN, "nrfx_spis_buffers_set, invalid state");
            if (spiMap[spi].slave_tx_buf_heap) {
                free(spiMap[spi].slave_tx_buf);
                spiMap[spi].slave_tx_buf_heap = false;
            }
            spiMap[spi].transmitting = false;
        } else {
            SPARK_ASSERT(err_code == NRF_SUCCESS);
        }
    }
}

void hal_spi_transfer_dma_cancel(hal_spi_interface_t spi) {
    if (!spiMap[spi].transmitting) {
        return;
    }
    spiTransferCancel(spi);
    spiMap[spi].dma_user_callback = nullptr;
    spiMap[spi].transmitting = false;
    freeMemoryIfNecessary(spi);
}

int32_t hal_spi_transfer_dma_status(hal_spi_interface_t spi, hal_spi_transfer_status_t* st) {
    int32_t transfer_length = 0;

    if (spiMap[spi].transmitting) {
        transfer_length = 0;
    } else {
        transfer_length = spiMap[spi].transfer_length;
        freeMemoryIfNecessary(spi);
    }

    if (st != nullptr) {
        st->configured_transfer_length = spiMap[spi].transfer_length;
        st->transfer_length = (uint32_t)transfer_length;
        st->transfer_ongoing = spiMap[spi].transmitting;
        st->ss_state = spiMap[spi].spi_ss_state;
    }

    return transfer_length;
}

int32_t hal_spi_set_settings(hal_spi_interface_t spi, uint8_t set_default, uint8_t clockdiv, uint8_t order, uint8_t mode, void* reserved) {
    if (set_default) {
        spiMap[spi].data_mode = DEFAULT_DATA_MODE;
        spiMap[spi].bit_order = DEFAULT_BIT_ORDER;
        spiMap[spi].clock = DEFAULT_SPI_CLOCK;
    } else {
        spiMap[spi].data_mode = mode;
        spiMap[spi].bit_order = order;
        spiMap[spi].clock = clockdiv;
    }

    if (spiMap[spi].state == HAL_SPI_STATE_ENABLED) {
        spiUninit(spi);
        spiInit(spi, spiMap[spi].spi_mode);
    }

